app/Models/System/Permission.php

    static function get_children()
    {
        $children_permissions = Cache::rememberForever('system_children_permissions', function () {
            return self::with([
                'children' => function ($query) {
                    $query->orderBy('sort_order','desc');
                }
            ])->where('parent_id', 0)->where('is_show',1)->orderBy('sort_order','desc')->get();
---
select * from `permissions` where `permissions`.`parent_id` in (3, 97, 105, 106, 107, 108, 121, 140, 222, 241) order by `sort_order` desc