app/Models/Shop/Cate.php

    static function get_categories()
    {
        //设置缓存,存入shop_categories

        $categories = Cache::rememberForever('jhm_categories', function () {
            return self::with([
                'children' => function ($query) {
                    $query->orderBy('sort');
                }
            ])->where('parent_id', 0)->orderBy('sort', 'desc')->get(); //一级分类
---
select * from `cates` where `cates`.`parent_id` in (1, 2, 3, 4, 5, 6, 7, 8, 332) order by `sort` asc